src/Reports/ЖурналУчетаРозничнойПродажиАлкогольнойПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Report>
		<Properties>
			<Name>ЖурналУчетаРозничнойПродажиАлкогольнойПродукции</Name>
			<Comment>Журнал учета объема розничной продажи алкогольной и спиртосодержащей продукции</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТитульныйЛист</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/InformationRegisters/СведенияОбАлкогольнойПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<InformationRegister>
		<Properties>
			<Name>СведенияОбАлкогольнойПродукции</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыАлкогольнойПродукции</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЛицензии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЛицензийНаПродажуАлкоголя</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффПересчетаДал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/AccumulationRegisters/ТоварыОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыОрганизаций</Name>
			<Comment>(Общ)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комиссионер</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ВидыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровКонтрагентов</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыОперацийПриходныйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПриходныйОрдер</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтПодотчетника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыОперацийРасходныйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРасходныйОрдер</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоПриходномуОрдеру</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходПоНакладной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/КомплектацияНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Document>
		<Properties>
			<Name>КомплектацияНоменклатуры</Name>
			<Comment>(общ)</Comment>
			<BasedOn>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.СчетНаОплатуПокупателю</xr:Item>
				<xr:Item>Document.ВнутреннийЗаказ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НДСНачисленный</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРознице</xr:Item>
				<xr:Item>AccumulationRegister.ВнутренниеЗаказы</xr:Item>
				<xr:Item>InformationRegister.СписанныеТовары</xr:Item>
				<xr:Item>AccumulationRegister.НДСВключенныйВСтоимость</xr:Item>
				<xr:Item>AccumulationRegister.НДСПредъявленный</xr:Item>
				<xr:Item>AccumulationRegister.НДСПартииТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.РеализованныеТовары</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезервеНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВУправленческомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВНалоговомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийКомплектацияНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСуммаДокумента</Name>
					<Comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособСписанияОстаткаТоваров</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыСписанияОстаткаТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСвСтоимостиТоваров</Name>
					<Comment>Необходимые действия по включению или исключению НДС в тоимости товаров при перемещении</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ДействиеНДСВСтоимостиТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комплектующие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоляСтоимости</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособСписанияОстаткаТоваров</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыСписанияОстаткаТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСумма</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Reports/ЖурналУчетаРозничнойПродажиАлкогольнойПродукции/Ext/ObjectModule.bsl
#Если Клиент Тогда

Процедура ВывестиТитульныйЛист(Результат, Макет, ПредставлениеОрганизации)
	
	ОбластьОрганизация      = Макет.ПолучитьОбласть("ТитульныйЛист");
	
	ОбластьОрганизация.Параметры.НазваниеОрганизации = ПредставлениеОрганизации;
	ОбластьОрганизация.Параметры.ПредставлениеПериода = УправлениеОтчетами.ПолучитьПредставлениеПериода(НачалоПериода, КонецПериода, 0);
	
	Если ЗначениеЗаполнено(Склад) Тогда
		ОбластьОрганизация.Параметры.Подразделение = Склад;
	КонецЕсли;
		
	Результат.Вывести(ОбластьОрганизация);
	Результат.ВывестиГоризонтальныйРазделительСтраниц();
	
	Результат.Область("R1:R" + Результат.ВысотаТаблицы).Имя = "ТитульныйЛист";
	
КонецПроцедуры

Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	Макет = Отчеты.ЖурналУчетаРозничнойПродажиАлкогольнойПродукции.ПолучитьМакет("Макет");

	ТабличныйДокумент.Очистить();
	
	// Выведем заголовок
	СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Организация, КонецПериода);
    ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,");
	
	// Выведем шапку
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
	Если ТитульныйЛист Тогда
		
		ВывестиТитульныйЛист(ТабличныйДокумент, Макет, ПредставлениеОрганизации);
		
	КонецЕсли;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");

	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("ОрганизацияНаименование", ПредставлениеОрганизации);
	Запрос.УстановитьПараметр("ОрганизацияИНН",	СведенияОбОрганизации.ИНН);
	Запрос.УстановитьПараметр("Склад", 			Склад);
	Запрос.УстановитьПараметр("ДатаНач", 		НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("ДатаКон", 		Новый Граница(КонецДня(КонецПериода), ВидГраницы.Включая));
	ИсключаемыеВидыДоговоров = Новый СписокЗначений;
	ИсключаемыеВидыДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
	Запрос.УстановитьПараметр("ИсключаемыеВидыДоговоров", ИсключаемыеВидыДоговоров);
	Текст =
		"ВЫБРАТЬ
		|	СведенияОбАлкогольнойПродукции.Номенклатура КАК Номенклатура,
		|	ВЫРАЗИТЬ(СведенияОбАлкогольнойПродукции.Номенклатура.НаименованиеПолное КАК СТРОКА(200)) КАК ТоварНаименование,
		|	СведенияОбАлкогольнойПродукции.КоэффПересчетаДал * 10 КАК Емкость,
		|	СведенияОбАлкогольнойПродукции.КоэффПересчетаДал КАК КоэффПересчетаДал,
		|	СведенияОбАлкогольнойПродукции.ВидПродукции.Наименование КАК ВидПродукции,
		|	СведенияОбАлкогольнойПродукции.ВидПродукции.КодВидаПродукции КАК КодВидаПродукции
		|ПОМЕСТИТЬ АлкогольнаяПродукция
		|ИЗ
		|	РегистрСведений.СведенияОбАлкогольнойПродукции КАК СведенияОбАлкогольнойПродукции
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот > 0
		|			ТОГДА АлкогольнаяПродукция.ВидПродукции + "" ("" + АлкогольнаяПродукция.ТоварНаименование + "")""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ВидПродукцииПоступление,
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот > 0
		|			ТОГДА АлкогольнаяПродукция.КодВидаПродукции
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК КодВидаПоступление,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА Обороты.КоличествоОборот > 0
		|					И (Обороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
		|						ИЛИ Обороты.Регистратор ССЫЛКА Документ.ОприходованиеТоваров
		|						ИЛИ Обороты.Регистратор ССЫЛКА Документ.КомплектацияНоменклатуры)
		|				ТОГДА &ОрганизацияНаименование
		|			КОГДА Обороты.Регистратор ССЫЛКА Документ.ПриходныйОрдерНаТовары
		|					И ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПриходныйОрдерНаТовары).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходныйОрдер.Перемещение)
		|				ТОГДА &ОрганизацияНаименование
		|			КОГДА НЕ АвансовыйОтчетТовары.Ссылка ЕСТЬ NULL 
		|				ТОГДА АвансовыйОтчетТовары.Поставщик.НаименованиеПолное
		|			КОГДА Обороты.КоличествоОборот > 0
		|				ТОГДА Обороты.Регистратор.Контрагент.НаименованиеПолное
		|			ИНАЧЕ """"
		|		КОНЕЦ КАК СТРОКА(1000)) КАК Поставщик,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА Обороты.КоличествоОборот > 0
		|					И (Обороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
		|						ИЛИ Обороты.Регистратор ССЫЛКА Документ.ОприходованиеТоваров
		|						ИЛИ Обороты.Регистратор ССЫЛКА Документ.КомплектацияНоменклатуры)
		|				ТОГДА &ОрганизацияИНН
		|			КОГДА Обороты.Регистратор ССЫЛКА Документ.ПриходныйОрдерНаТовары
		|					И ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПриходныйОрдерНаТовары).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходныйОрдер.Перемещение)
		|				ТОГДА &ОрганизацияИНН
		|			КОГДА НЕ АвансовыйОтчетТовары.Ссылка ЕСТЬ NULL 
		|				ТОГДА АвансовыйОтчетТовары.Поставщик.ИНН
		|			КОГДА Обороты.КоличествоОборот > 0
		|				ТОГДА Обороты.Регистратор.Контрагент.ИНН
		|			ИНАЧЕ """"
		|		КОНЕЦ КАК СТРОКА(1000)) КАК ИНН,
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот > 0
		|			ТОГДА ВЫБОР
		|					КОГДА Обороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
		|						ТОГДА ВЫБОР
		|								КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг).НомерВходящегоДокумента = """"
		|									ТОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг).Номер
		|								ИНАЧЕ ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг).НомерВходящегоДокумента
		|							КОНЕЦ
		|					КОГДА Обороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслугВНТТ
		|						ТОГДА ВЫБОР
		|								КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслугВНТТ).НомерВходящегоДокумента = """"
		|									ТОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслугВНТТ).Номер
		|								ИНАЧЕ ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслугВНТТ).НомерВходящегоДокумента
		|							КОНЕЦ
		|					КОГДА НЕ АвансовыйОтчетТовары.Ссылка ЕСТЬ NULL 
		|							И (АвансовыйОтчетТовары.НомерВходящегоДокумента <> """"
		|								ИЛИ АвансовыйОтчетТовары.ДатаВходящегоДокумента <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|						ТОГДА АвансовыйОтчетТовары.НомерВходящегоДокумента
		|					ИНАЧЕ Обороты.Регистратор.Номер
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК НомерТТН,
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот > 0
		|			ТОГДА ВЫБОР
		|					КОГДА Обороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
		|						ТОГДА ВЫБОР
		|								КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг).ДатаВходящегоДокумента = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|									ТОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг).Дата
		|								ИНАЧЕ ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг).ДатаВходящегоДокумента
		|							КОНЕЦ
		|					КОГДА Обороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслугВНТТ
		|						ТОГДА ВЫБОР
		|								КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслугВНТТ).ДатаВходящегоДокумента = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|									ТОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслугВНТТ).Дата
		|								ИНАЧЕ ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслугВНТТ).ДатаВходящегоДокумента
		|							КОНЕЦ
		|					КОГДА НЕ АвансовыйОтчетТовары.Ссылка ЕСТЬ NULL 
		|							И (АвансовыйОтчетТовары.НомерВходящегоДокумента <> """"
		|								ИЛИ АвансовыйОтчетТовары.ДатаВходящегоДокумента <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|						ТОГДА АвансовыйОтчетТовары.ДатаВходящегоДокумента
		|					ИНАЧЕ Обороты.Регистратор.Дата
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ДатаТТН,
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот > 0
		|			ТОГДА АлкогольнаяПродукция.Емкость
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ЕмкостьПоступление,
		|	СУММА(ВЫБОР
		|			КОГДА Обороты.КоличествоОборот > 0
		|				ТОГДА Обороты.КоличествоОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоПоступление,
		|	СУММА(ВЫБОР
		|			КОГДА Обороты.КоличествоОборот > 0
		|				ТОГДА Обороты.КоличествоОборот * АлкогольнаяПродукция.КоэффПересчетаДал
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОбъемПоступление,
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот > 0
		|			ТОГДА Обороты.Регистратор
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ДокументПоступление,
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот < 0
		|			ТОГДА Обороты.Регистратор
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ДокументРасход,
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот < 0
		|				И Обороты.Регистратор ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|			ТОГДА ""Проданная продукция""
		|		КОГДА Обороты.КоличествоОборот < 0
		|				И (Обороты.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
		|					ИЛИ Обороты.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщикуИзНТТ
		|					ИЛИ Обороты.Регистратор ССЫЛКА Документ.КорректировкаПоступления)
		|			ТОГДА ""Продукция, возвращенная поставщику""
		|		КОГДА Обороты.Регистратор ССЫЛКА Документ.СписаниеТоваров
		|			ТОГДА ""Недостачи продукции""
		|		КОГДА Обороты.КоличествоОборот < 0
		|				И (Обороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
		|					ИЛИ Обороты.Регистратор ССЫЛКА Документ.КомплектацияНоменклатуры)
		|			ТОГДА ""Продукция, переданная в другое подразделение""
		|		КОГДА Обороты.Регистратор ССЫЛКА Документ.РасходныйОрдерНаТовары
		|			ТОГДА ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.РасходныйОрдерНаТовары).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходныйОрдер.РасходПоНакладной)
		|						ТОГДА ""Проданная продукция""
		|					КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.РасходныйОрдерНаТовары).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходныйОрдер.Перемещение)
		|						ТОГДА ""Продукция, переданная в другое подразделение""
		|					КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.РасходныйОрдерНаТовары).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходныйОрдер.ВозвратПоставщику)
		|						ТОГДА ""Продукция, возвращенная поставщику""
		|					КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.РасходныйОрдерНаТовары).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходныйОрдер.ВозвратПоПриходномуОрдеру)
		|						ТОГДА ""Продукция, возвращенная поставщику""
		|				КОНЕЦ
		|		КОГДА Обороты.КоличествоОборот < 0
		|			ТОГДА ""Списанная продукция""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК СодержаниеРасход,
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот < 0
		|			ТОГДА АлкогольнаяПродукция.ВидПродукции + "" ("" + АлкогольнаяПродукция.ТоварНаименование + "")""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ВидПродукцииРасход,
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот < 0
		|			ТОГДА АлкогольнаяПродукция.Емкость
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ЕмкостьРасход,
		|	СУММА(ВЫБОР
		|			КОГДА Обороты.КоличествоОборот < 0
		|				ТОГДА -Обороты.КоличествоОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК КоличествоРасход,
		|	СУММА(ВЫБОР
		|			КОГДА Обороты.КоличествоОборот < 0
		|				ТОГДА -Обороты.КоличествоОборот * АлкогольнаяПродукция.КоэффПересчетаДал
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОбъемРасход
		|ИЗ
		|	АлкогольнаяПродукция КАК АлкогольнаяПродукция
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.Обороты(&ДатаНач, &ДатаКон, Регистратор, &Условие) КАК Обороты
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.АвансовыйОтчет.Товары КАК АвансовыйОтчетТовары
		|			ПО Обороты.Номенклатура = АвансовыйОтчетТовары.Номенклатура
		|				И (Обороты.Регистратор = АвансовыйОтчетТовары.Ссылка
		|					ИЛИ Обороты.Регистратор = АвансовыйОтчетТовары.Ссылка.СкладОрдер)
		|		ПО АлкогольнаяПродукция.Номенклатура = Обороты.Номенклатура
		|ГДЕ
		|	НЕ Обороты.Регистратор ССЫЛКА Документ.КорректировкаКачестваТоваров
		|	И НЕ Обороты.Регистратор ССЫЛКА Документ.КорректировкаСерийИХарактеристикТоваров
		|	И ВЫБОР
		|			КОГДА НЕ Обороты.Регистратор.ДоговорКонтрагента ЕСТЬ NULL 
		|				ТОГДА НЕ Обороты.Регистратор.ДоговорКонтрагента.ВидДоговора В (&ИсключаемыеВидыДоговоров)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	Обороты.Период,
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот > 0
		|			ТОГДА АлкогольнаяПродукция.ВидПродукции + "" ("" + АлкогольнаяПродукция.ТоварНаименование + "")""
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот > 0
		|			ТОГДА АлкогольнаяПродукция.КодВидаПродукции
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот > 0
		|			ТОГДА АлкогольнаяПродукция.Емкость
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот > 0
		|			ТОГДА Обороты.Регистратор
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот < 0
		|			ТОГДА Обороты.Регистратор
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот < 0
		|			ТОГДА АлкогольнаяПродукция.ВидПродукции + "" ("" + АлкогольнаяПродукция.ТоварНаименование + "")""
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот < 0
		|			ТОГДА АлкогольнаяПродукция.Емкость
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА Обороты.КоличествоОборот > 0
		|					И (Обороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
		|						ИЛИ Обороты.Регистратор ССЫЛКА Документ.ОприходованиеТоваров
		|						ИЛИ Обороты.Регистратор ССЫЛКА Документ.КомплектацияНоменклатуры)
		|				ТОГДА &ОрганизацияНаименование
		|			КОГДА Обороты.Регистратор ССЫЛКА Документ.ПриходныйОрдерНаТовары
		|					И ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПриходныйОрдерНаТовары).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходныйОрдер.Перемещение)
		|				ТОГДА &ОрганизацияНаименование
		|			КОГДА НЕ АвансовыйОтчетТовары.Ссылка ЕСТЬ NULL 
		|				ТОГДА АвансовыйОтчетТовары.Поставщик.НаименованиеПолное
		|			КОГДА Обороты.КоличествоОборот > 0
		|				ТОГДА Обороты.Регистратор.Контрагент.НаименованиеПолное
		|			ИНАЧЕ """"
		|		КОНЕЦ КАК СТРОКА(1000)),
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА Обороты.КоличествоОборот > 0
		|					И (Обороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
		|						ИЛИ Обороты.Регистратор ССЫЛКА Документ.ОприходованиеТоваров
		|						ИЛИ Обороты.Регистратор ССЫЛКА Документ.КомплектацияНоменклатуры)
		|				ТОГДА &ОрганизацияИНН
		|			КОГДА Обороты.Регистратор ССЫЛКА Документ.ПриходныйОрдерНаТовары
		|					И ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПриходныйОрдерНаТовары).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходныйОрдер.Перемещение)
		|				ТОГДА &ОрганизацияИНН
		|			КОГДА НЕ АвансовыйОтчетТовары.Ссылка ЕСТЬ NULL 
		|				ТОГДА АвансовыйОтчетТовары.Поставщик.ИНН
		|			КОГДА Обороты.КоличествоОборот > 0
		|				ТОГДА Обороты.Регистратор.Контрагент.ИНН
		|			ИНАЧЕ """"
		|		КОНЕЦ КАК СТРОКА(1000)),
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот > 0
		|			ТОГДА ВЫБОР
		|					КОГДА Обороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
		|						ТОГДА ВЫБОР
		|								КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг).НомерВходящегоДокумента = """"
		|									ТОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг).Номер
		|								ИНАЧЕ ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг).НомерВходящегоДокумента
		|							КОНЕЦ
		|					КОГДА Обороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслугВНТТ
		|						ТОГДА ВЫБОР
		|								КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслугВНТТ).НомерВходящегоДокумента = """"
		|									ТОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслугВНТТ).Номер
		|								ИНАЧЕ ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслугВНТТ).НомерВходящегоДокумента
		|							КОНЕЦ
		|					КОГДА НЕ АвансовыйОтчетТовары.Ссылка ЕСТЬ NULL 
		|							И (АвансовыйОтчетТовары.НомерВходящегоДокумента <> """"
		|								ИЛИ АвансовыйОтчетТовары.ДатаВходящегоДокумента <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|						ТОГДА АвансовыйОтчетТовары.НомерВходящегоДокумента
		|					ИНАЧЕ Обороты.Регистратор.Номер
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот > 0
		|			ТОГДА ВЫБОР
		|					КОГДА Обороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
		|						ТОГДА ВЫБОР
		|								КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг).ДатаВходящегоДокумента = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|									ТОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг).Дата
		|								ИНАЧЕ ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслуг).ДатаВходящегоДокумента
		|							КОНЕЦ
		|					КОГДА Обороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслугВНТТ
		|						ТОГДА ВЫБОР
		|								КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслугВНТТ).ДатаВходящегоДокумента = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|									ТОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслугВНТТ).Дата
		|								ИНАЧЕ ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.ПоступлениеТоваровУслугВНТТ).ДатаВходящегоДокумента
		|							КОНЕЦ
		|					КОГДА НЕ АвансовыйОтчетТовары.Ссылка ЕСТЬ NULL 
		|							И (АвансовыйОтчетТовары.НомерВходящегоДокумента <> """"
		|								ИЛИ АвансовыйОтчетТовары.ДатаВходящегоДокумента <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|						ТОГДА АвансовыйОтчетТовары.ДатаВходящегоДокумента
		|					ИНАЧЕ Обороты.Регистратор.Дата
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА Обороты.КоличествоОборот < 0
		|				И Обороты.Регистратор ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|			ТОГДА ""Проданная продукция""
		|		КОГДА Обороты.КоличествоОборот < 0
		|				И (Обороты.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщику
		|					ИЛИ Обороты.Регистратор ССЫЛКА Документ.ВозвратТоваровПоставщикуИзНТТ
		|					ИЛИ Обороты.Регистратор ССЫЛКА Документ.КорректировкаПоступления)
		|			ТОГДА ""Продукция, возвращенная поставщику""
		|		КОГДА Обороты.Регистратор ССЫЛКА Документ.СписаниеТоваров
		|			ТОГДА ""Недостачи продукции""
		|		КОГДА Обороты.КоличествоОборот < 0
		|				И (Обороты.Регистратор ССЫЛКА Документ.ПеремещениеТоваров
		|					ИЛИ Обороты.Регистратор ССЫЛКА Документ.КомплектацияНоменклатуры)
		|			ТОГДА ""Продукция, переданная в другое подразделение""
		|		КОГДА Обороты.Регистратор ССЫЛКА Документ.РасходныйОрдерНаТовары
		|			ТОГДА ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.РасходныйОрдерНаТовары).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходныйОрдер.РасходПоНакладной)
		|						ТОГДА ""Проданная продукция""
		|					КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.РасходныйОрдерНаТовары).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходныйОрдер.Перемещение)
		|						ТОГДА ""Продукция, переданная в другое подразделение""
		|					КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.РасходныйОрдерНаТовары).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходныйОрдер.ВозвратПоставщику)
		|						ТОГДА ""Продукция, возвращенная поставщику""
		|					КОГДА ВЫРАЗИТЬ(Обороты.Регистратор КАК Документ.РасходныйОрдерНаТовары).ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходныйОрдер.ВозвратПоПриходномуОрдеру)
		|						ТОГДА ""Продукция, возвращенная поставщику""
		|				КОНЕЦ
		|		КОГДА Обороты.КоличествоОборот < 0
		|			ТОГДА ""Списанная продукция""
		|		ИНАЧЕ """"
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Обороты.Период";
		
	СтрокаУсловия = "Комиссионер = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) И 
	| Организация = &Организация";
	
	Если ЗначениеЗаполнено(Склад) Тогда
		СтрокаУсловия = СтрокаУсловия + " И Склад = &Склад";
	КонецЕсли;
	
	Текст = СтрЗаменить(Текст, "&Условие", СтрокаУсловия);
	Запрос.Текст = Текст;
	Результат = Запрос.Выполнить().Выбрать();
	
	НомерСтроки 			= 1;
	ОбъемПоступление		= 0;
	ОбъемРасход 			= 0;
	КоличествоПоступление	= 0;
	КоличествоРасход		= 0;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");

	Пока Результат.Следующий() Цикл
		
		ОбластьМакета.Параметры.НомерСтроки = НомерСтроки;
		ОбластьМакета.Параметры.Заполнить(Результат);
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбъемПоступление 		= ОбъемПоступление + Результат.ОбъемПоступление;
		ОбъемРасход 			= ОбъемРасход + Результат.ОбъемРасход;
		КоличествоПоступление 	= КоличествоПоступление + Результат.КоличествоПоступление;
		КоличествоРасход 		= КоличествоРасход + Результат.КоличествоРасход;

		НомерСтроки 			= НомерСтроки + 1;
		
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
	
	ОбластьМакета.Параметры.ОбъемПоступление 		= ОбъемПоступление;
	ОбластьМакета.Параметры.ОбъемРасход 			= ОбъемРасход;
	ОбластьМакета.Параметры.КоличествоПоступление 	= КоличествоПоступление;
	ОбластьМакета.Параметры.КоличествоРасход 		= КоличествоРасход;
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ТабличныйДокумент.ПовторятьПриПечатиСтроки = ТабличныйДокумент.Область("СтрокиДляПовтора");
	
	УправлениеОтчетами.УстановитьКолонтитулыПоУмолчанию(
		ТабличныйДокумент, , Строка(глЗначениеПеременной("глТекущийПользователь")));
	
КонецПроцедуры

#КонецЕсли
